---
type: FilterStringRule
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# FilterStringRule

`Autodesk.Revit.DB.FilterStringRule` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FilterStringRule | 2022 | `public FilterStringRule ( FilterableValueProvider valueProvider , FilterStringRuleEvaluator evaluator , string ruleString )` |
| Method | GetEvaluator | 2011 | `public FilterStringRuleEvaluator GetEvaluator ()` |
| Method | SetEvaluator | 2011 | `public void SetEvaluator ( FilterStringRuleEvaluator evaluator )` |
| Property | RuleString | 2011 | `public string RuleString { get ; set ; }` |